#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВходПользователя(_)
    Если ЗначениеЗаполнено(ЭтотОбъект.Логин) = Ложь Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = "Логин должен быть заполнен.";
        сообщение.Поле = "Логин";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();

        Возврат;
    КонецЕсли;

    выполнитьАутентификациюПользователяНаСервере(ЭтотОбъект.Логин);
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура выполнитьАутентификациюПользователяНаСервере(Знач логин)
    Аутентификация.ВыполнитьАутентификацию(логин);
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
